Revit 2026 API

# BlendBottomSketch Property

---

Returns the Bottom Sketch of the Blend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch BottomSketch { get; }
```
```vb
Public ReadOnly Property BottomSketch As Sketch
	Get
```
```cpp
public:
property Sketch^ BottomSketch {
	Sketch^ get ();
}
```
```fsharp
member BottomSketch : Sketch with get
```

#### Property Value

Sketch

This property is used to retrieve the Bottom Sketch of the Blend.

#### Reference

Blend Class

Autodesk.Revit.DB Namespace